ChrisHayward-dev/Arduino_core_SapphireMini/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cache=Cache
menu.speed=CPU Speed
menu.opt=Optimize
menu.maxqspi=Max QSPI
menu.usbstack=USB Stack
menu.debug=Debug

# -----------------------------------
# Sapphire Mini (SAMD21) <based on Adafruit Feather M0>
# -----------------------------------
sapphire_mini.name=Sapphire Mini M0 (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
sapphire_mini.vid.0=0x239A
sapphire_mini.pid.0=0x800B
sapphire_mini.vid.1=0x239A
sapphire_mini.pid.1=0x000B
sapphire_mini.vid.2=0x239A
sapphire_mini.pid.2=0x0015

# Upload
sapphire_mini.upload.tool=bossac18
sapphire_mini.upload.protocol=sam-ba
sapphire_mini.upload.maximum_size=262144
sapphire_mini.upload.offset=0x2000
sapphire_mini.upload.use_1200bps_touch=true
sapphire_mini.upload.wait_for_upload_port=true
sapphire_mini.upload.native_usb=true

# Build
sapphire_mini.build.mcu=cortex-m0plus
sapphire_mini.build.f_cpu=48000000L
sapphire_mini.build.usb_product="Feather M0"
sapphire_mini.build.usb_manufacturer="Adafruit"
sapphire_mini.build.board=SAMD_ZERO
sapphire_mini.build.core=arduino
sapphire_mini.build.extra_flags=-D__SAMD21G18A__ -DADAFRUIT_FEATHER_M0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
sapphire_mini.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
sapphire_mini.build.openocdscript=openocd_scripts/feather_m0.cfg
sapphire_mini.build.variant=sapphire_mini
sapphire_mini.build.variant_system_lib=
sapphire_mini.build.vid=0x239A
sapphire_mini.build.pid=0x800B
sapphire_mini.bootloader.tool=openocd
sapphire_mini.bootloader.file=sapphire_mini/bootloader-sapphire_mini-v2.0.0-adafruit.5.bin

# Menu
sapphire_mini.menu.opt.small=Small (-Os) (standard)
sapphire_mini.menu.opt.small.build.flags.optimize=-Os
sapphire_mini.menu.opt.fast=Fast (-O2)
sapphire_mini.menu.opt.fast.build.flags.optimize=-O2
sapphire_mini.menu.opt.faster=Faster (-O3)
sapphire_mini.menu.opt.faster.build.flags.optimize=-O3
sapphire_mini.menu.opt.fastest=Fastest (-Ofast)
sapphire_mini.menu.opt.fastest.build.flags.optimize=-Ofast
sapphire_mini.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
sapphire_mini.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
sapphire_mini.menu.usbstack.arduino=Arduino
sapphire_mini.menu.usbstack.tinyusb=TinyUSB
sapphire_mini.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
sapphire_mini.menu.debug.off=Off
sapphire_mini.menu.debug.on=On
sapphire_mini.menu.debug.on.build.flags.debug=-g


